[
    {
        "Insulin":"What better to battle diabetes than this anti - diabetic miracle ‘Insulin plant’ that has been extensively researched upon? It is perfectly low maintenance and all in the same while being highly health benefiting. In parts of India these leaves are traditionally consumed to battle diabetes mellitus and several researches have been conducted to see it’s positive impact on health. Go ahead and buy this if you need something that you don’t have to bother about much, but would still be a healthy gold mine in your little garden. It is the best herb to have at home if any loved one has diabetes. The leaves have corosolic acid that aids in insulin secretion, and thereby it is called the insulin plant. ",
        "Aloevera":"We are no strangers to the universally hailed ‘wonder plant’, Aloe vera. Known for its endless health benefits, it used to be planted in every house under curry leaves trees as a tradition. Bringing it back, wouldn’t it be handy to have this all purpose plant in our apartments even in the busiest of the cities? Aloe vera is known for its antioxidant properties, skin healing tendencies, body heat reduction… and this list is literally endless. Go ahead and buy this little treasure cove, which you can propagate into multiple pots later on. It is said that having a shot of aloe vera juice every day keeps us young and healthy all life and it has centuries of documented benefits and usage through history. ",
        "MiracleleafBryophyllum":"This little plant is called ‘Leaf of life’ for it’s life enhancing properties and medicinal value as it is used to treat shortness of breath, asthma, bronchitis and even kidney stones. You can use this as a quick remedy to insect bites, bruises, boils and even skin ulcers. It is called ‘Pancharuti’ and it is truly named right, for it is a miracle.Go ahead and buy this if you want a handy herb, an aromatic plant to spice up your table. This is a must - have when you have kids as this can be a quick remedy. This is an excellent blood purifier and can bring your blood toxicity level to zero"
    }
]